## Pandas Basic

!pip install pandas #for installing pandas

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
df1 = pd.DataFrame([[1, 1, 1], [2, 4, 8], [3, 9, 27], 
                  [4, 16, 64], [5, 25, 125], [6, 36, 216], 
                  [7, 49, 343]])

In [5]:
df1 #print(df1) for others

   0   1    2
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125
5  6  36  216
6  7  49  343

In [6]:
df1.head() #it will take automatically

   0   1    2
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125

In [7]:
df1.head(3)

   0  1   2
0  1  1   1
1  2  4   8
2  3  9  27

In [8]:
df1.tail(2)

   0   1    2
5  6  36  216
6  7  49  343

In [10]:
df1.shape

(7, 3)

In [13]:
df1.iloc[1,2]

8

In [16]:
df1.iloc[0:2,1:3]

   1  2
0  1  1
1  4  8

In [18]:
 df2 = pd.DataFrame([[1, 1, 1], [2, 4, 8], [3, 9, 27], 
                  [4, 16, 64], [5, 25, 125], [6, 36, 216], 
                  [7, 49, 343]],columns=['a', 'b', 'c'])

In [19]:
df2.tail(2)

   a   b    c
5  6  36  216
6  7  49  343